<?php

class DataModel {

    public $hobbiesNames = ["Моя любимая музыка", "Мои любимые фильмы", "Мои любимые книги"];
    
    public $hobbiesDescriptions = ["Вито Андолини после гибели отца перебрался из Сицилии в США и взял себе новое имя — Корлеоне. Товарищи Клеменца и Тессио втянули его в преступную деятельность. Вместе они провернули несколько удачных акций, но местный преступник Фануччи, узнав об этом, стал требовать мзду. Корлеоне для вида согласился с его требованиями и даже заплатил, но затем убил Фануччи. Тем самым Корлеоне приобрёл авторитет у местных жителей, начавших обращаться к нему со своими проблемами. За несколько лет Корлеоне создал мафиозный клан и неуклонно расширял свою империю. Его легальный бизнес — поставка оливкового масла, однако общий контроль клана Корлеоне простирается на многие сферы, включая властные и силовые структуры.
    Действие романа начинается в августе 1945 года. Особняк дона Вито Корлеоне полон гостей: лидер самого влиятельного в Нью-Йорке мафиозного клана выдаёт замуж дочь Констанцию (Конни). Кроме неё у главы семьи есть сыновья — Сантино (Санни), считающийся вероятным преемником Крёстного отца; Фредерико (Фред), преданный общему делу, но не обладающий смелостью старшего брата; Майкл, выбравший для себя другую стезю — он поступил добровольцем в морскую пехоту, воевал, после демобилизации по ранению поступил в Дартмутский университет.
    Вскоре после свадебных торжеств Крёстный отец принимает мафиози Вергилия Солоццо. Тот готов начать продавать в США наркотики и просит Крёстного отца дать ему взаймы денег и обеспечить прикрытие со стороны судей, политиков и полицейских, подконтрольных Корлеоне. Дон отвечает отказом. Солоццо рассчитывает, что после смерти неуступчивого дона власть в семье Корлеоне перейдёт к более сговорчивому и менее опытному Санни. На Крёстного отца совершается покушение. Майклу, пришедшему в больницу навестить отца, удаётся сорвать очередное покушение. Санни приступает к ответным действиям, убив сына дона Таттальи. Выясняется, что за Солоццо стоят не только «пять семей» американской мафии, но и продажный капитан полиции Макклоски.Майкл понимает, что Солоццо слишком опасен, он нацелен на убийство дона Корлеоне. Он соглашается встретиться с Солоццо и на встрече в ресторане убивает Солоццо и Макклоски. Майкл покидает Америку и укрывается на Сицилии. Начинается война между кланом Корлеоне и Пятью семьями, которая заходит в тупик. Воспользовавшись предательством Карло Рицци, мужа Конни, Татталья заманивают в ловушку и убивают Санни. Майкл едва не гибнет от руки предателя Фабрицио на Сицилии. Дон Корлеоне собирает глав самых крупных американских «семей» и призывает их прекратить войну. Ему приходится принять условие дона Барзини о поддержке наркотрафика и отказаться от мести семье Татталья. Барзини с самого начала стоял за Татталья и Солоццо, он мечтает занять место Корлеоне.","Led Zeppelin — британская рок-группа, образовавшаяся в сентябре 1968 года в Лондоне, и признанная одной из самых
    успешных, новаторских и влиятельных в современной истории. Создав собственное звучание (для которого были характерны
    утяжелённый гитарный драйв, оглушающее звучание
    ритм-секции и пронзительный вокал), Led Zeppelin стали одной из ведущих групп хард-рока, сыграли основополагающую
    роль в становлении хеви-метала, свободно интерпретируя фолк- и блюз-классику и обогащая стиль элементами других
    музыкальных жанров (рокабилли, рэгги, соул, фанка, кантри).Остаётся одной из наиболее успешных групп в рок-музыке:
    общемировой тираж альбомов превышает 300 миллионов, 112 миллионов было продано в США (четвёртое место). Семь
    альбомов группы поднимались на вершину Billboard 200.Занимает первое место в списке VH1 «100 величайших артистов
    хард-рока». Журнал Rolling Stone признал коллектив «самой тяжёлой группой» и «лучшей группой 70-х». В 1995 году Led
    Zeppelin были введены в Зал славы рок-н-ролла, в 2005 году получили Грэмми за вклад на протяжении всей карьеры
    (Grammy Lifetime Achievement Award), в мае 2006 года — Polar Music Prize."," Отправной точкой для сценаристов послужила повесть Джозефа Конрада «Сердце тьмы» (1902).
    Фильм был удостоен премии «Оскар» за лучшую операторскую работу и лучший звук, а на Каннском фестивале разделил «Золотую пальмовую ветвь» с лентой Ф. Шлёндорфа «Жестяной барабан».
    «Я уверен, что создал произведение искусства и не мог сделать лучше», — сказал Фрэнсис Коппола об «Апокалипсисе».
    Главная сюжетная линия фильма — рассказ о капитане спецназа Уилларде, посланном в джунгли Камбоджи,
     чтобы устранить сошедшего с ума полковника Курца, который командует отрядом из местных жителей и обвиняется в убийстве
      нескольких нужных американскому правительству вьетнамцев. В ходе путешествия с Уиллардом происходит много странных событий,
       и под воздействием окружающей обстановки он по мере приближения к цели постепенно теряет ощущение реальности и перестаёт
    понимать, что ему делать дальше.
    В главных ролях выступили Мартин Шин, сыгравший капитана Уилларда, и Марлон Брандо в роли полковника Курца.
     В числе других ярких персонажей — полусумасшедший фотожурналист-философ в поселении Курца в исполнении Денниса Хоппера
      и эксцентричный командир «воздушной кавалерии» подполковник Килгор в исполнении Роберта Дюваля. В эпизодических ролях
       были заняты такие актёры, как Харрисон Форд, Скотт Гленн и Лоренс Фишберн."];

       public $hobbiesImgPath = ["public\images\LZ.jpg", "public\images\apocalypse.jpg", "public\images\godfather.jpg"];

}